word_filter_set = ['육변기', '워마드', '응디', '니기미', '맘충', '씹창', '거렁뱅이', '갈보', '미친놈',
'빠구리', '김치년', '개씨발', '메갈', '메갈리아', '섹스', '시발새끼', '보전꺠', '씨방새', '니미씨발',
 '씹', 'ㅆㅂ', '불알', '쎅스', '핑두', '보지년', '오피누', '놈딱', '잠지', '섻스',
'간나새끼', '개돼지', '씹쌔끼', '꼬추걸레', '조팔', '한남', '짭새', '걸레년', '개좆', '미친년', '옘병', '닭대가리', '느그앰', '4카시', '후빨', '개년', '미친새끼', '개새끼', '북딱', '빙신', '빨통', '시발롬', '니미럴', "니기럴",'닥쳐', '저능아', '사카시', '씨방년', '보빨', '썅년', '이기야', 'ㅆ발', '보전깨', '똘추', '씹쌔', '노슬아치', '썅놈', '시발', '병신', '느금', '씹썌', '등신', 'ㅅㅂ', '느금마', "느거매",'돌대가리', '십색갸', '니미', '씨팔', '놈현', '지잡', '빠9리', '셋스', '십색꺄', '니애미', '시부랄', '씹치녀', '개간년', '씨발', '급식충', '오피녀', '개지랄', '씨방놈', '엄창', '보슬아치', '십색기', "보지보지", '뻐큐', '한남충', '걸레련', '냄져', '느그미', '봊', '김치녀', '나가디지라', '시브랄', '빡대가리', '붕알', '씨부랄', '노무혐', '딸딸이', '좆', 'ㅈㄹ'
, '개씹', '부엉이바위', '따까리', '부랄', '씹치남', '염병', '페미', '시발련', '보빨러', '사까시', '자댕이', '니앰', '싸가지', '니엄', '틀딱', '노알라', '엠창', '느개비', '돼지새끼', '씨브랄',
'꼬걸', '틀딱충', '개씹할', '창녀', '창년', '시발년', '씝뽈', '개자석', '호로새끼']

def check_word_filter(str_temp):
	for word in word_filter_set:
		if word in str_temp:
			return True
	return False